sdaiPutADBValue(Sdai_ADBId*,SdaiPrimitiveType,BTEllipsis)
\details
Sets the type and value in the ADB.
\param block [in] the ADB instance.
\param valueType [in] value type.
\param ... [in] values to set.